Revit 2021.1 API
BarTypeDiameterOptions.BarDiameter Property
 Represents the bar diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2018.1
Syntax
C#
public double BarDiameter { get; set; }
Visual Basic
Public Property BarDiameter As Double
	Get
	Set
Visual C++
public:
property double BarDiameter {
	double get ();
	void set (double value);
}
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace